[
  {
    "id": 1,
    "name": "Portfolio Website",
    "description": "A sleek and responsive personal portfolio showcasing projects, technical skills, and development experience. Built with Vue.js and TailwindCSS, optimized for performance and accessibility.",
    "status": "active",
    "demo": "https://ayoub-tribak.vercel.app/",
    "github": "https://github.com/Tribak-Ayoub/my-portfolio",
    "thumbnail": "/images/my-portfolio.png",
    "video": "/videos/my-portfolio.mp4",
    "technologies": ["Vue.js", "TailwindCSS", "Vercel"],
    "role": "Front-end Developer – Designed and developed the portfolio UI using Vue.js and TailwindCSS, ensuring fast load times and a smooth user experience across devices."
  },
  {
    "id": 2,
    "name": "Blog App",
    "description": "A modular blog platform featuring CRUD article management, nested commenting, RESTful APIs, and a clean user interface. Built using Laravel for the backend and Vue.js for the frontend.",
    "status": "completed",
    "demo": "#",
    "github": "https://github.com/Tribak-Ayoub/Blog-app",
    "thumbnail": "/images/blog-app.png",
    "video": "/videos/blog-app.mp4",
    "technologies": ["Laravel", "Vue.js", "TailwindCSS", "MySQL", "REST API"],
    "role": "Full-stack Developer – Built the back-end logic and API with Laravel, integrated Vue.js for the UI, and structured the project with a scalable modular architecture."
  },
  {
    "id": 3,
    "name": "Electricien – WordPress Website",
    "description": "A professional WordPress website for electricien, featuring responsive design, custom theme development, plugin integration, and optimized for SEO and performance.",
    "status": "active",
    "demo": "https://electricien.kesug.com",
    "github": "#",
    "thumbnail": "/images/electricien.png",
    "video": "/videos/electricien.mp4",
    "technologies": ["WordPress", "PHP", "HTML", "CSS", "JavaScript"],
    "role": "Full-stack Developer – Developed a custom WordPress theme, integrated essential plugins, ensured responsive design, and optimized the site for SEO and performance."
  },
  {
    "id": 4,
    "name": "Sanction Management Module – SOLI-LMS",
    "description": "A fully integrated module within SOLI-LMS for automating the management of learner sanctions related to absenteeism. Features include customizable rule-based sanction calculations, daily automatic checks, manual triggers, visual dashboards, and a detailed sanction history log.",
    "status": "completed",
    "demo": "#",
    "github": "https://github.com/Tribak-Ayoub/Project-fil-rouge",
    "thumbnail": "/images/sanctions.png",
    "video": "/videos/sanctions.mp4",
    "technologies": ["Laravel", "Vue.js", "TailwindCSS", "MySQL", "Inertia.js"],
    "role": "Full-stack Developer – Led the development of the Sanction Management module, including logic implementation in Laravel, dynamic dashboard integration using Vue.js, and MySQL database design for tracking rule-based sanctions."
  },
  {
    "id": 5,
    "name": "AI-Powered Phone Lead Qualification System",
    "description": "An AI-driven telephony system that qualifies leads via phone by combining SIP integration, voice interaction (STT, NLP, TTS), and real-time API communication between Asterisk, Python microservices, and Laravel.",
    "status": "on-hold",
    "demo": "#",
    "github": "https://github.com/Tribak-Ayoub/AI-Voice-Assistant",
    "thumbnail": "/images/ai-call-system.png",
    "video": "/videos/ai-call-system.mp4",
    "technologies": [
      "Python",
      "FastAPI",
      "Asterisk",
      "Laravel",
      "Vue.js",
      "PostgreSQL"
    ],
    "role": "Full-stack Developer – Developing Python microservices for speech processing, integrating FastAPI endpoints with Laravel, and building a Vue.js dashboard to monitor and manage call activity and lead qualification results."
  },
  {
    "id": 6,
    "name": "IoT Real-Time Sensor Dashboard",
    "description": "A complete real-time IoT monitoring system using the MERN-like stack (MongoDB, Express, Node) combined with Vue.js. It features live sensor data streaming via Socket.io, historical data visualization with charts, and a responsive dashboard.",
    "status": "completed",
    "demo": "#",
    "github": "https://github.com/Tribak-Ayoub/IoT-Dashboard",
    "thumbnail": "/images/iot-dashboard.png",
    "video": "/videos/iot-dashboard.mp4",
    "technologies": [
      "Node.js",
      "Express.js",
      "MongoDB",
      "Socket.io",
      "Vue.js",
      "TailwindCSS",
      "Chart.js"
    ],
    "role": "Full-stack Developer – Designed and implemented a robust real-time architecture, including a REST API, Socket.io server for live data push, Mongoose data models, and a reactive Vue 3 dashboard for visualization and alerting."
  }
]
